import React from "react";
import "../../sass/pages/AboutUsPage.scss";
import AboutUs from "../AboutUs";
import {motion} from "framer-motion";

const AboutUsPage = () => {
    const aboutText2 =
        <p className={"pl-lg-5"}>
            و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد و کاربردهای متنوع با هدف بهبود ابزارهای
            کاربردی می باشد. کتابهای زیادی در شصت مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
            نیاز از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و لورم ایپسوم متن ساختگی با
            تولید سادگی نامفهوم
            <br/>
            و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد و کاربردهای متنوع با هدف بهبود ابزارهای
            کاربردی می باشد. کتابهای زیادی در شصت مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
            نیاز از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و اب یگتخاس نتم موسپیا مرول
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم و اهرگپاچ .تسا کیفارگ ناحارط زا هدافتسا اب و پاچ تعنص زا
            موهفمان یگداس دیلوت یلعف طیارش یارب و تسا مزال هک نانچنآرطس و نوتس رد هلجم و همانزور هکلب نوتم .دشاب یم
            یدربراک یاهرازبا دوبهب فده اب عونتم یاهدربراک و زاین دروم یژولونکت و هعماج ناوارف تخانش هدنیآ و لاح ،هتشذگ
            دصرد هس و تصش رد یدایز یاهباتک یلع یا هنایار ناحارط یارب ار یرتشیب تخانش اهرازفا مرن اب ات دبلط یم ار
            ناصصختم یم تروص نیا رد .درک داجیا یسراف نابز رد ورشیپ گنهرف و یقالخ ناحارط صوصخلا هب پیات تخس طیارش و
            اهراکهار هئارا رد دوجوم یراوشد و مامت هک تشاد دیما ناوت تالاوس یوگباوج و یلصا یاهدرواتسد ینیچفورح لماش زاین
            دروم نامزو دسر نایاپ .دریگ رارق هدافتسا دروم اساسا یحارط دوجوم یایند لها هتسویپ
        </p>
    return (
        <div className={"container"}>
            <motion.div
                initial={{opacity: 0, transitionDuration: "1s"}}
                whileInView={{opacity: 1}}
            >
                <AboutUs title={false}>{aboutText2}</AboutUs>
            </motion.div>
        </div>
    );
}

export default AboutUsPage;